Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: You can use a tuple type as the return type for a function to return multiple values as part of one compound return value.
ja: あなたは、関数の戻り型としてタプル型を使って、複数の値をひとつの複合の戻り値の一部として返すことができます。

source: You can use a tuple type as the return type of a function to enable the function to return a single tuple containing multiple values.
ja: あなたは、関数の戻り型としてタプル型を使って、その関数に複数の値を含んでいる１つのタプルを返すのを可能にすることができます。

source: You can use all three of the inherited initializers to create a new ShoppingListItem instance:
ja: あなたは、継承されたイニシャライザの３つ全てを新しいShoppingListItemインスタンスをつくるために使うことができます：

source: You can use an if statement to find out whether an optional contains a value by comparing the optional against nil.
ja: あなたは、if文を、あるオプショナルが値を含むかどうか知るために使うことができます、それは、そのオプショナルをnilと比べることによって行います。

source: You can use an empty dictionary literal to create an empty dictionary literal of specified key and value types.
ja: あなたは、空の辞書リテラルを使って、指定されたキーと値型の空の辞書リテラルを作成できます。

source: You can use an extension to add protocol conformance to a type that is declared elsewhere, or even to a type that you imported from a library or framework.
ja: あなたは１つの拡張を使用することで、どこかほかで宣言される型に、またはあなたがライブラリやフレームワークからインポートした型にさえもプロトコル準拠を加えることができます。

source: You can use an extension to add protocol conformance, like this:
ja: あなたはある拡張を使って、このようにプロトコル準拠を加えることが出来ます：

source: You can use an instance of ThreeSource as the data source for a new Counter instance:
ja: あなたは、ThreeSourceのインスタンスを新しいCounterインスタンスのためのデータ・ソースとして使うことができます：

source: You can use an instance of TowardsZeroSource with the existing Counter instance to count from -4 to zero.
ja: あなたは、TowardsZeroSourceのインスタンスを既存のCounterインスタンスとともに使って、-4からゼロへと数えることができます。

source: You can use assignment syntax in the definition of a wrapped value to pass the expression on the right-hand side of the assignment as the argument to the wrappedValue parameter of the property wrapper’s initializer.
ja: あなたは、代入構文をラップ値の定義において使用して、代入の右手側での式を、プロパティラッパーのもつイニシャライザのwrappedValueパラメータに対する引数として渡せます。

source: You can use bit shifting to encode and decode values within other data types:
ja: あなたは、他のデータ型内の値を符号化したり復号するために、ビットシフトを使うことができます：

source: You can use both constants and variables with optional binding.
ja: あなたは、定数と変数の両方をオプショナル束縛で使用できます。

source: You can use extended delimiters to create strings with characters that would ordinarily have a special effect such as generating a string interpolation, starting an escape sequence, or terminating the string.
ja: あなたは拡張区切り記号を使うことで、例えば文字列補間を生成する、エスケープシーケンスを開始する、または文字列を終端するなど、通常は特別な効果を持つ文字で文字列を作成できます。

source: You can use extended delimiters to include the text """ in a multiline string, overriding the default behavior that ends the literal.
ja: あなたは拡張区切り文字を使うことで、テキスト"""を複数行文字列の中に含めることが、省略時の挙動であるリテラルの終わりをオーバーライドして行えます。

source: You can use extended string delimiters to create strings containing characters that would otherwise be treated as a string interpolation.
ja: あなたは、拡張文字列区切り記号を使うことで、そうしなければ文字列補間とみなされる文字を含んでいる文字列を作成できます。

source: You can use forced unwrapping in an initializer to call a failable initializer from the superclass as part of the implementation of a subclass’s nonfailable initializer.
ja: あなたは、強制アンラップをイニシャライザの中で使うことで、失敗できるイニシャライザをスーパークラスから呼び出し、サブクラスの失敗できないイニシャライザの実装の一部とすることができます。

source: You can use nested functions to organize the code in a function that is long or complex.
ja: あなたは、長いか複雑である関数においてコードを組織するために、入れ子にされた関数を使用することができます。

source: You can use optional binding to check whether this version of the minMax(array:) function returns an actual tuple value or nil:
ja: あなたは、minMax(array:)関数のこの改作が返すのは本当のタプルなのかまたはnilなのかを調べるためにオプショナル束縛を使うことが出来ます：

source: You can use optional chaining to call a method on an optional value, and to check whether that method call is successful.
ja: あなたはオプショナル連鎖を使って、オプショナルの値の上でメソッドを呼んで、そしてそのメソッド呼び出しが成功しているかどうか調べることができます。

source: You can use optional chaining to try to retrieve and set a value from a subscript on an optional value, and to check whether that subscript call is successful.
ja: あなたは、オプショナル連鎖を使って、あるオプショナルの値上の添え字から値を取り出したり設定したりすること、そしてその添え字がうまく呼び出されるかどうかを調べることができます。

source: You can use optional chaining with calls to properties, methods, and subscripts that are more than one level deep.
ja: あなたは、深さ１階層以上であるプロパティ、メソッド、そして添え字への呼び出しでオプショナル連鎖を使うことができます。

source: You can use parentheses to specify the precedence of operations by explicitly grouping expressions.
ja: あなたは丸括弧を使って、明示的にいくらかの式をグループにまとめることによって演算の優先順位を指定することができます。

source: You can use property overriding to add property observers to an inherited property.
ja: あなたは、プロパティをオーバーライドすることを継承されたプロパティにプロパティオブザーバーを追加するために使用できます。

source: You can use protocol extensions to provide a default implementation to any method or computed property requirement of that protocol.
ja: あなたはプロトコル拡張を使うことで省略時の実装をそのプロトコルのどのメソッドまたは計算プロパティ要件に対しても提供できます。

source: You can use protocols to declare which methods a delegate of a class or structure should implement, as described in Delegation.
ja: あなたはプロトコルを使って、あるクラスまたは構造体から委任を受ける側が実装しなければならないのはどのメソッドかを宣言することができます、委任で記述されるように。

source: You can use string interpolation in both single-line and multiline string literals.
ja: あなたは、文字列補間を単一行および複数行文字列リテラルにおいて使うことができます。

source: You can use subscript syntax to access the Character at a particular String index.
ja: あなたは、添え字構文を使うことで特定のStringインデックス位置でのCharacterへアクセスできます。

source: You can use subscript syntax to change an existing value at a given index:
ja: あなたは、添え字構文を使って、与えられたインデックス位置にある既存の値を変えることができます：

source: You can use subscript syntax to remove a key-value pair from a dictionary by assigning a value of nil for that key:
ja: あなたは添え字構文を、そのキーに対してnilの値を代入することによって、辞書からある「キーと値」の対を削除するために使うことができます：

source: You can use the AudioChannel structure to create two new audio channels called leftChannel and rightChannel, to represent the audio levels of a stereo sound system:
ja: あなたは、AudioChannel構造体を、leftChannelとrightChannelと呼ばれる２つの新しい音声チャンネルをつくるために使用して、ステレオ・オーディオ・システムの音声のレベルを表すことができます：

source: You can use the fatalError(_:file:line:) function during prototyping and early development to create stubs for functionality that hasn’t been implemented yet, by writing fatalError("Unimplemented") as the stub implementation.
ja: あなたは、fatalError(_:file:line:)関数を試作段階および開発初期の間に使って、まだ実装されていない機能性に対してスタブ（代用品）を作成することが、fatalError("Unimplemented")をスタブ実装として記述することによって行えます。

source: You can use the hasPrefix(_:) method with the romeoAndJuliet array to count the number of scenes in Act 1 of the play:
ja: あなたは、劇の「一幕（Act 1）」の場面の数を数えるためにhasPrefix(_:)メソッドをromeoAndJuliet配列で使用することができます：

source: You can use the insert(_:at:), insert(contentsOf:at:), remove(at:), and removeSubrange(_:) methods on any type that conforms to the RangeReplaceableCollection protocol.
ja: あなたは、insert(_:at:)、insert(contentsOf:at:)、remove(at:)、そしてremoveSubrange(_:)メソッドをRangeReplaceableCollectionプロトコルに準拠するあらゆる型で使うことができます。

source: You can use the is and as operators described in Type Casting to check for protocol conformance, and to cast to a specific protocol.
ja: あなたは、型キャストで記述されるisとas演算子を特定のプロトコルへキャストするために使うことができます。

source: You can use the startIndex and endIndex properties and the index(before:), index(after:), and index(_:offsetBy:) methods on any type that conforms to the Collection protocol.
ja: あなたは、startIndexとendIndexプロパティそしてindex(before:)、index(after:)、およびindex(_:offsetBy:)メソッドをCollectionプロトコルに準拠するあらゆる型で使うことができます。

source: You can use the rawValue property to access the raw value of an enumeration case, as in ExampleEnum.b.rawValue.
ja: あなたは、rawValueプロパティを使うことで列挙ケース節の生の値にアクセスできます、ExampleEnum.b.rawValueにおけるように。

source: You can use the abbreviated form anytime the value’s type is already known.
ja: あなたは、値の型がすでに知られているときはいつでも省略形を使うことができます。

source: You can use the postfix self expression to access a type as a value.
ja: あなたは、接尾辞self式を使って、ある型に値としてアクセスすることができます。

source: You can use this argument to name classes, enumerations, enumeration cases, protocols, methods, getters, setters, and initializers.
ja: あなたはこの引数を、クラス、列挙、列挙ケース、プロトコル、メソッド、ゲッター、セッター、そしてイニシャライザに名前をつけるために使うことができます。

source: You can use this failable initializer to choose an appropriate enumeration case for the three possible states and to cause initialization to fail if the parameter does not match one of these states:
ja: あなたは、この失敗できるイニシャライザを使って、適切な列挙ケース節を３つの可能な状態に対して選び取るように、そしてパラメータが３つの状態の内の１つに合わない場合に初期化が失敗するようにできます。

source: You can use this failable initializer to try to initialize a new Animal instance and to check if initialization succeeded:
ja: あなたは、この失敗できるイニシャライザを使うことで、新しいAnimalインスタンスを初期化することを試みて、初期化が成功したか確認することができます。

source: You can use this initializer to initialize a new constant called theAceOfSpades:
ja: あなたは、theAceOfSpadesと呼ばれる新しい定数を初期化するために、このイニシャライザを使うことができます：

source: You can use this initializer to try to create a new instance of the enumeration.
ja: あなたは、このイニシャライザを使って、この列挙の新しいインスタンスを作成するように試みることができます。

source: You can use this optional return value to check whether the optional chaining call was successful (the returned optional contains a value), or did not succeed due to a nil value in the chain (the returned optional value is nil).
ja: あなたは、このオプショナルの戻り値を使って、オプショナル連鎖呼び出しが成功した（返されたオプショナルが値を含む）か、あるいは連鎖の中のnil値のために成功しなかった（返されたオプショナルの値がnilである）かどうか確認することができます。

source: You can use this syntax to hard wrap a multiline string literal in your source code, without changing the value of the resulting string.
ja: あなたは、この構文を使うことで、複数行文字列リテラルをあなたのソースコードにおいてハードラップする（次行に送る）ことが、結果となる文字列の値を変更することなく行えます。

source: You can use this type like any other type in Swift, which makes it easy to pass functions as parameters to other functions, and to return functions from functions.
ja: あなたはスウィフトの他のあらゆる型と同じようにこの型を使うことができます、そしてそれは、他の関数へのパラメータとして関数を渡して、関数から関数を返すことを簡単にします。

source: You can use tuples to test multiple values in the same switch statement.
ja: あなたは、複数の値を同じswitch文において試験するためにタプルを使うことができます。

source: You can use type casting with a hierarchy of classes and subclasses to check the type of a particular class instance and to cast that instance to another class within the same hierarchy.
ja: あなたは、いくつかのクラスおよびサブクラスからなるある階層とともに型キャストを使って、特定のクラスインスタンスの型を調べて、そのインスタンスを同じ階層内の別のクラスにキャストすることができます。

source: You can use your own custom types as set value types or dictionary key types by making them conform to the Hashable protocol from Swift’s standard library.
ja: あなたは、あなた独自のあつらえの型を集合の値型または辞書のキー型として使用することが、それらをスウィフトの標準ライブラリからのHashableプロトコルに適合させることで可能です。

source: You can write a closure without a name by surrounding code with braces ({}).
ja: あなたは、名前なしで波括弧（{}）でコードを囲むことによってクロージャを書くことができます。

source: You can write code that avoids duplication and expresses its intent in a clear, abstracted manner.
ja: あなたは、重複を避けて、明快な、抽象化された手法で、その意図を表すコードを書くことができます。

source: You can write the Fahrenheit structure from above in a simpler form by providing a default value for its temperature property at the point that the property is declared:
ja: あなたは、上記のFahrenheit構造体を、そのtemperatureプロパティのために省略時の値をそのプロパティが宣言される時点で用意することによって、より単純な形式で書くことができます：

source: You can write the same functionality as a generic function by replacing any mention of strings with values of some type T instead.
ja: あなたは同じ機能性を総称体関数として書くことが、何であれ文字列への言及部分をその代わりにある何らかの型Tの値で置き換えることで行えます。

source: You cannot add property observers to inherited constant stored properties or inherited read-only computed properties.
ja: あなたは、プロパティオブザーバーを、継承された定数格納プロパティに、または継承された読み出し専用の計算プロパティに加えることができません。

source: You cannot define a failable and a nonfailable initializer with the same parameter types and names.
ja: あなたは、失敗できる及び失敗できないイニシャライザを同じパラメータの型と名前で定義することはできません。

source: You cannot pass a constant or a literal value as the argument, because constants and literals cannot be modified.
ja: あなたは引数として定数またはリテラル値を渡すことができません、なぜなら定数とリテラルは修正されることができないからです。

source: You cannot, however, present an inherited read-write property as a read-only property.
ja: あなたは、しかし、継承された読み書き両用プロパティを、読み出し専用のプロパティとして提示することができません。

source: You can’t append a String or Character to an existing Character variable, because a Character value must contain a single character only.
ja: あなたはStringまたはCharacterを既存のCharacter変数に追加することはできません、なぜならCharacter値がただ１つの文字だけを含まなければならないためです。

source: You can’t iterate over a one-sided range that omits a first value, because it isn’t clear where iteration should begin.
ja: あなたは、最初の値を省いた片側範囲に対して反復していくことができません、なぜならどこで反復が始まるべきかが明瞭でないからです。

source: You can’t mark a variadic parameter or a return type with the inout keyword.
ja: あなたは、可変長パラメータまたは戻り型にinoutキーワードで印をつけることができません。

source: You can’t overload a function based only on whether the function can throw an error.
ja: あなたはある関数を、その関数がエラーをスローできるかどうかのみに基づいてオーバーロードできません。

source: You can’t pass in any type here, however—it has to be a type for which UInt16 provides an initializer.
ja: しかしながら、あなたはあらゆる型をここに渡すことはできません ― それはUInt16がイニシャライザを提供する型でなければなりません。

source: You can’t provide an explicit access-level modifier for an extension if you’re using that extension to add protocol conformance.
ja: あなたがプロトコル準拠を加えるためにその拡張を使っているならば、あなたは明確なアクセス水準修飾子を拡張のために用意することが出来ません。

source: You can’t set a protocol requirement to a different access level than the protocol it supports.
ja: あなたは、あるプロトコル要件をそれが支えるプロトコルと異なるアクセス水準に設定することができません。

source: You can’t specify a different access level for individual enumeration cases.
ja: あなたは、個々の列挙ケース節に対して異なるアクセス水準を指定することができません。

source: You can’t use Container as the return type of a function because that protocol has an associated type.
ja: あなたはContainerを関数の戻り型として使用できません、なぜならそのプロトコルが関連型を持つからです。

source: You can’t use nil with non-optional constants and variables.
ja: あなたは、nilを非オプショナルの定数および変数で使うことができます。

source: You can’t use an unlabeled break statement to break out of an if statement.
ja: あなたは、ラベルを付けられないbreak文をif文を脱するために使うことはできません。

source: You check for an implementation of an optional method by writing a question mark after the name of the method when it’s called, such as someOptionalMethod?(someArgument).
ja: あなたは、それが呼ばれるときに疑問符をそのメソッドの後に書くことによって、あるオプショナルメソッドの実装について確認することができます、例えばsomeOptionalMethod?(someArgument)のように。

source: You could use generics to implement operations like flipping a shape vertically, as shown in the code below.
ja: あなたは総称体を使って、ある形状を垂直に裏返すような演算を実装できました、下のコードで示されるように。

source: You could write code that uses the behavior of a property wrapper, without taking advantage of the special attribute syntax.
ja: あなたはプロパティラッパーの挙動を使うコードを、この特別な属性構文を利用することなく記述できます。

source: You create a new Stack instance by writing the type to be stored in the stack within angle brackets.
ja: あなたは、新しいStackインスタンスを、角括弧の内側にそのスタックの中に格納される型を書くことによって作成します。

source: You create a new instance of Vehicle with initializer syntax, which is written as a type name followed by empty parentheses:
ja: あなたは、Vehicleの新しいインスタンスを初期化構文を使って作成します、それは１つの型名に続く空の丸括弧として書かれます：

source: You declare constants with the let keyword and variables with the var keyword.
ja: あなたは、letキーワードを使って定数を、varキーワードを使って変数を宣言します。

source: You define properties and methods to add functionality to your structures and classes using the same syntax you use to define constants, variables, and functions.
ja: あなたはプロパティとメソッドを定義することで、あなたの構造体およびクラスに機能性を加えます、それには定数、変数、そして関数を定義するのにあなたが使うのと同じ構文を使います。

source: You define protocols in a very similar way to classes, structures, and enumerations:
ja: あなたは、クラス、構造体、および列挙と非常に類似した方法で、プロトコルを定義します：

source: You define this form of a variable declaration at global scope, the local scope of a function, or in the context of a class or structure declaration.
ja: あなたは、変数宣言のこの形式を、グローバルなスコープ、関数のローカルなスコープで、またはクラスおよび構造体宣言の文脈において定義します。

source: You define this form of a variable declaration at global scope, the local scope of a function, or in the context of a class, structure, enumeration, or extension declaration.
ja: あなたは、変数宣言のこの形式を、グローバルなスコープ、関数のローカルなスコープで、またはクラス、構造体、列挙、および拡張宣言の文脈において定義します。

source: You define type aliases with the typealias keyword.
ja: あなたは、typealiasキーワードで型エイリアスを定義します。

source: You define type properties with the static keyword.
ja: あなたは、型プロパティをstaticキーワードを使って定義します。

source: You do not have to provide an explicit implementation of a required initializer if you can satisfy the requirement with an inherited initializer.
ja: あなたは、あなたがある継承されたイニシャライザの要件を満たすことができるならば、必須イニシャライザの明示的な実装を提供する必要はありません。

source: You do not have to provide convenience initializers if your class does not require them.
ja: あなたのクラスがそれらを必要としないならば、あなたは便宜イニシャライザを提供する必要はありません。

source: You do not need to specify the type of the closure’s input parameter, number, because the type can be inferred from the values in the array to be mapped.
ja: あなたはクロージャの入力パラメータ、numberの型を指定する必要がありません、なぜならその型が対応付けされる配列の値から推論されることができるからです。

source: You do not specify a precedence when defining a prefix or postfix operator.
ja: あなたは、接頭辞または接尾辞演算子を定義するときに優先順位を指定しません。

source: You do not write the override modifier when overriding a required designated initializer:
ja: あなたは、必須指定イニシャライザをオーバーライドする時にoverride修飾子を書きません：

source: You do this by defining a generic where clause.
ja: あなたはこれを総称体where節を定義する事によって行います。

source: You do this by writing a complete function type immediately after the return arrow (->) of the returning function.
ja: あなたは、返すことになる関数の戻り矢印（->）の直後に完全な関数型を書くことによってこれをします。

source: You do this by writing the break statement as the entire body of the case you want to ignore.
ja: あなたは、break文をあなたが無視したいケース節の全本文として書くことによってこれをします。

source: You do this with an empty extension, as described in Declaring Protocol Adoption with an Extension:
ja: 拡張を使ってプロトコル採用を宣言するで記述されるように、あなたは空の拡張でこれを行います

source: You don’t know in advance which actual class to use for each item, and so it is appropriate to use the conditional form of the type cast operator (as?) to check the downcast each time through the loop:
ja: あなたは、前もって、各項目のために使われる実際のクラスがどれかを知りません、なので適切なのは、型キャスト演算子の条件形式（as?）を使用してループを通して毎回ダウンキャストを確認することです：

source: You don’t need to define property observers for nonoverridden computed properties, because you can observe and respond to changes to their value in the computed property’s setter.
ja: あなたは、オーバーライドされていない計算プロパティのためにプロパティオブザーバーを定義する必要はありません、なぜならあなたは計算プロパティのセッターにおいてそれらの値の変化を観察して応答することができるからです。

source: You don’t need to import a separate library for functionality like input/output or string handling.
ja: あなたは、入力／出力または文字列取り扱いのような機能性のために個々のライブラリをインポートする必要はありません。

source: You don’t need to mark protocol initializer implementations with the required modifier on classes that are marked with the final modifier, because final classes can’t subclassed.
ja: あなたはfinal修飾子で印されるクラス上でプロトコルイニシャライザ実装をrequired修飾子で印する必要はありません、なぜなら、finalクラスはサブクラスを作られることができないからです。

source: You enable this by writing : CaseIterable after the enumeration’s name.
ja: あなたは、これを: CaseIterableを列挙の名前の後に書くことによって可能にします。

source: You extract each associated value as a constant (with the let prefix) or a variable (with the var prefix) for use within the switch case’s body:
ja: あなたは、関連値それぞれを定数（let接頭辞を使って）または変数（var接頭辞を使って）としてswitchのケース節の本文内で使用するために抽出します：

source: You get the same behavior of delayed evaluation when you pass a closure as an argument to a function.
ja: あなたが同じ挙動の延期した評価を得るのは、あなたがクロージャを引数として関数に渡す時です。

source: You give a function a name that identifies what it does, and this name is used to “call” the function to perform its task when needed.
ja: あなたは関数にそれが何をするかについて識別する名前を与えます、そしてこの名前が必要なときその作業を実行するために関数を「呼び出す」のに使われます。

source: You have access to the type parameters (and any of their associated types) in the rest of the type, function, or initializer declaration, including in the signature of the function or initializer.
ja: あなたは、そのままの型、関数、またはイニシャライザ宣言の中の、さらに含めて関数またはイニシャライザのシグネチャの中の、型パラメータ（およびあらゆるそれの関連型）にアクセスします。

source: You have several options for writing closures more concisely.
ja: あなたは、より簡潔にクロージャを書くためにいくつかの選択肢を持ちます。

source: You have the option to define either or both of these observers on a property:
ja: あなたは、あるプロパティに関してこれらのオブザーバーのどちらかまたは両方とも定義する選択肢を持ちます：

source: You implement a prefix or postfix unary operator by writing the prefix or postfix modifier before the func keyword when declaring the operator method:
ja: あなたは、接頭辞または接尾辞単項演算子を、prefixまたはpostfix修飾子をfuncキーワードの前に演算子メソッドを宣言するときに書くことによって実装します：

source: You implement this initialization process by defining initializers, which are like special methods that can be called to create a new instance of a particular type.
ja: あなたはこの初期化処理をイニシャライザを定義することによって実装します、それは、特定の型の新しいインスタンスをつくるために呼ばれることができる特別なメソッドのようなものです。

source: You indicate a lazy stored property by writing the lazy modifier before its declaration.
ja: あなたは、lazy修飾子をその宣言の前に書くことによって遅延格納プロパティであることを示します。

source: You indicate a type subscript by writing the static keyword before the subscript keyword.
ja: あなたは型添え字を、staticキーワードをsubscriptキーワードの前に書くことによって指し示します。

source: You indicate a weak reference by placing the weak keyword before a property or variable declaration.
ja: あなたは、プロパティまたは変数の宣言の前にweakキーワードを置くことによって弱い参照を示します。

source: You indicate an unowned reference by placing the unowned keyword before a property or variable declaration.
ja: あなたは、プロパティまたは変数の宣言の前にunownedキーワードを置くことによって非所有参照を示します。

source: You indicate an unsafe unowned reference by writing unowned(unsafe).
ja: あなたは、安全でない非所有参照をunowned(unsafe)を書くことによって指し示します。

source: You indicate that an enumeration case is recursive by writing indirect before it, which tells the compiler to insert the necessary layer of indirection.
ja: あなたは、ある列挙ケース節が再帰することをそれの前にindirectを書くことによって指し示します、それは、コンパイラに不可欠な間接参照の階層を差し入れるように伝えます。

source: You indicate the function’s return type with the return arrow -> (a hyphen followed by a right angle bracket), which is followed by the name of the type to return.
ja: あなたは、関数の戻り型を、戻り矢印->（ハイフンに続けて右の山形括弧）、それに続く返す型の名前で示します。

source: You indicate type methods by writing the static keyword before the method’s func keyword.
ja: あなたは、型メソッドをstaticキーワードをメソッドのfuncキーワードの前に書くことによって示します。

source: You indicate whether a particular String can be modified (or mutated) by assigning it to a variable (in which case it can be modified), or to a constant (in which case it can’t be modified):
ja: あなたは、特定のStringが修正される（または変化する）ことができるかどうか、それを変数（その場合それは修が可能です）にまたは定数（その場合それは修正できません）に代入することによって示します：

source: You introduce enumerations with the enum keyword and place their entire definition within a pair of braces:
ja: あなたは、列挙をenumキーワードで始めて、一対の波括弧の内側にそれらの全ての定義を置きます：

source: You introduce structures with the struct keyword and classes with the class keyword.
ja: あなたは、structキーワードで構造体を、そしてclassキーワードでクラスを始めます。

source: You mark a compound assignment operator’s left input parameter type as inout, because the parameter’s value will be modified directly from within the operator method.
ja: あなたは複合代入演算子の左入力パラメーター型をinoutとして印します、なぜなら、このパラメーターの値は直接にこの演算子メソッド内で修正されることになるからです。

source: You may have noticed that the bodies of the swapTwoInts(_:_:), swapTwoStrings(_:_:), and swapTwoDoubles(_:_:) functions are identical.
ja: あなたは、swapTwoInts(_:_:)、swapTwoStrings(_:_:)、そしてswapTwoDoubles(_:_:)関数の本文が同一であると気がついたかもしれません。

source: You may, however, want to mark some parts of your code as file private or private in order to hide their implementation details from other code within the app’s module.
ja: あなたは、しかし、あなたのコードのいくつかの部分をファイル外非公開または非公開として印して、それらの実施詳細をそのアプリのモジュール内の他のコードから隠したいかもしれません。

source: You might expect this function to have the default access level of “internal”, but this isn’t the case.
ja: あなたはこの関数が省略時アクセス水準の「内部」を持つのを期待するかもしれません、しかし事実はそうではありません。

source: You might want to run an extra piece of code when an error occurs, or to display a message when a value becomes too high or too low.
ja: あなたは、エラーが発生する時にコードの臨時の小片を実行したいかもしれません、またある値があまりに高いかあまりに低くなる時にお知らせを表示したいかもしれません。
